Repository: Paybyway/visma-pay-prestashop-8
Catalog: translations/*/ModulesVismapayVismaPayConfiguration.*.xlf
Languages: fi_fi

source: Api key
fi_fi: Yksityinen rajapinta-avain

source: Banks
fi_fi: Pankit

source: Choose how payment methods are displayed
fi_fi: Ota upotetut maksupainikkeet käyttöön

source: Clear customer's cart when they are redirected to pay
fi_fi: Tyhjennä ostoskori maksamaan siirtymisen yhteydessä

source: Credit cards
fi_fi: Korttimaksut

source: Credit invoices
fi_fi: Luottolaskut

source: Disabled
fi_fi: Pois käytöstä

source: Embed
fi_fi: Upotus

source: Embed: After choosing Visma Pay on the checkout-page, the payment methods and their logos are then shown.
fi_fi: Upotus: Kun kassasivulla valitaan maksutavaksi Visma Pay, niin tulevat kauppiastilille aktivoidut maksutavat näkyviin logojensa kera.

source: Enable bank payments in the Visma Pay payment page.
fi_fi: Ota verkkopankkipainikkeet käyttöön maksusivulla.

source: Enable credit cards in the Visma Pay payment page.
fi_fi: Ota korttimaksut käyttöön maksusivulla.

source: Enable credit invoices in the Visma Pay payment page.
fi_fi: Ota lasku- ja osamaksu-maksutavat käyttöön maksusivulla.

source: Enable wallet services in the Visma Pay payment page.
fi_fi: Ota lompakkopalvelut käyttöön maksusivulla.

source: Enable, disable or force sending product details to Visma Pay, should normally be Enable.
fi_fi: Ota käyttöön, poista päältä tai pakota tuote-erittelyn lähetys. Yleensä arvon tulisi olla Käytössä.

source: Enabled
fi_fi: Käytössä

source: Forced
fi_fi: Pakota

source: Order number prefix
fi_fi: Tilaustunnuksen etuliite

source: Payment method display
fi_fi: Maksutapojen näyttäminen

source: Private key
fi_fi: Yksityinen salausavain

source: Redirect
fi_fi: Pois käytöstä

source: Redirect: After choosing Visma Pay at the checkout-page the customer is redirected to the Visma Pay payment-page.
fi_fi: Pois käytöstä: Kassasivulla voidaan valita maksutavaksi Visma Pay. Asiakas ohjataan Visma Payn maksusivulle valitsemaan maksutapa.

source: Save
fi_fi: Tallenna

source: Send Visma Pay payment confirmation
fi_fi: Lähetä maksuvahvistus

source: Send a payment confirmation to the customer's email from Visma Pay.
fi_fi: Lähetä asiakkaan sähköpostiin Visma Payn maksuvahvistus.

source: Send product details to Visma Pay
fi_fi: Lähetä tuote-erittely maksurajapintaan

source: Separate
fi_fi: Eritelty

source: Separate: All the payment methods on your Visma Pay merchant account are separated as their own payment method on the checkout-page.
fi_fi: Eritelty: Kaikki Visma Pay kauppiastilille aktivoidut maksutavat näkyvät verkkokaupan kassasivulla erillisinä maksutapoina.

source: Settings
fi_fi: Asetukset

source: Wallets
fi_fi: Lompakkopalvelut

source: When this option is enabled, the customer's shopping cart will be emptied when they are redirected to pay for their order. The cart will be restored if the customer cancels their payment or the payment fails.
fi_fi: Tämän asetuksen ollessa käytössä tyhjennetään asiakkaan ostokori, kun asiakas siirtyy maksamaan tilaustaan. Asetuksella voidaan vähentää virheitä tilanteissa, joissa asiakas yrittää samanaikaisesti tehdä useaa maksua samalla ostoskorilla. Ostoskorin sisältö palautetaan, jos asiakas keskeyttää maksamisen tai maksun veloitus epäonnistuu.

source: is invalid
fi_fi: on virheellinen
