Repository: Paybyway/visma-pay-prestashop-8
Catalog: translations/*/ModulesVismapayVismaPayOrderController.*.xlf
Languages: fi_fi

source: An unexpected error occurred.
fi_fi: Tapahtui odottamaton virhe.

source: Invalid or expired form token.
fi_fi: Lomaketunniste on virheellinen tai vanhentunut.

source: Order not found.
fi_fi: Tilausta ei löytynyt.

source: Order number not found for settlement.
fi_fi: Tilausnumeroa ei löytynyt veloitusta varten.

source: Payment cannot be settled. Either the payment has already been settled or the payment gateway refused to settle payment for given transaction.
fi_fi: Maksua ei voitu veloittaa. Joko maksu on jo veloitettu, tai luottolaitos hylkäsi veloituspyynnön.

source: Payment cannot be settled. Transaction for given order number was not found.
fi_fi: Maksua ei voitu veloittaa. Maksutapahtumaa ei löytynyt annetulla tilaustunnuksella.

source: Payment settled.
fi_fi: Maksu veloitettu.

source: Request failed. Validation failed.
fi_fi: Pyyntö epäonnistui. Validointivirhe.

source: Unexpected error during the settlement.
fi_fi: Odottamaton virhe veloitusta tehdessä.

source: Visma Pay module is disabled.
fi_fi: Visma Pay -lisäosa on poistettu käytöstä.
